tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# DuckDuckGo from the terminal
brew "ddgr"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Improved top (interactive process viewer)
brew "htop"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# File browser
brew "ranger"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Team communication and collaboration software
cask "slack"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
