tap "carlocab/personal"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# DuckDuckGo from the terminal
brew "ddgr"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Extract, view, and test RAR archives
brew "carlocab/personal/unrar"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Media player based on MPlayer and mplayer2
cask "mpv"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Digital audio production application
cask "reaper"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video editor
cask "shotcut"
# Team communication and collaboration software
cask "slack"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Comic reader
cask "yacreader"
# Video communication and virtual meeting platform
cask "zoom"
